{
   "channel_id":1148595440804188202,
   "channel_name":"🚿┃pressure-washing-course",
   "sections":[
      {
         "content":"🚿 **Pressure Washing Course** 🚿\n\n\"Pressure Washing Side Hustle\"",
         "section_url":"https://vimeo.com/862552877/65ea3a5698?share=copy",
         "section":"video",
         "delete":"1"
      },
      {
         "content":"**Summary:**\n- Pressure washing is using a pressure washer to clean surfaces\n- Family and friends are the easiest way to get your first clients\n- The only equipment you need to get started is a pressure washer\n- You can charge between $150-$400 depending on the size of the job\n- The easiest way to accept payment is cash\n\n**Action steps:**\n- Acquire a pressure washer\n- Reach out to your family & friends offering to pressure wash for them\n- Pressure wash for them\n- Receive your payments",
         "section_url":null,
         "section":"summary",
         "delete":"0"
      },
      {
         "content":"**Pressure Washing Simple Steps:**\n\n**Step 1:** Complete the Pressure Washing course\nThe first step is to go through the Pressure Washing course.\nYou will learn how to get started getting paid for pressure washing.\n\n**Step 2:** Ask your family and friends to pressure wash for them\nThe easiest clients to gain are people you already trust such as your family and friends.\n\n**Step 3:** Do the pressure washing\nOnce someone agrees to let you pressure wash, you have to do it.\nArrange a time for you to go over to do it.\nBring your pressure washer. Electric and gas power are fine.\n\n**Step 4:** Profit\nOnce the task is completed, ask your client for payment.\nThe simplest way is to accept cash.\nYou can also set up a recurring payment for a repeating service using a bank transfer.\n\n**Step 5:** Expand your client base\nIf you run out of new clients within your family & friends and can take on more work, expand your outreach audience.\n\nKnock on doors and hand out pamphlets in your neighborhood.\nJoin local Facebook groups and advertise your services. Learn more in Harness Your Facebook.",
         "section_url":null,
         "section":"general",
         "delete":"1"
      },
      {
         "content":"How much should you charge?\n\nA $150-$400\nB $70-$100\nC $50-$75",
         "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
      }
   ]
}