{
   "channel_id":1147377749175042110,
   "channel_name":"⭐┃rsps-lessons",
   "sections":[
      {
         "content":"***What is the Relative Strength Portfolio Strategy?*** <:pepebusiness:1147485405860601956> \n \nThe relative strength portfolio strategy uses a tiered TPI-like system that:\n> Manages the exposure to the overall market.\n> Manages the balance between individual large-caps, \n> Manages the balance between large-caps and small-caps as groups.\n> Manages the balance between small-caps and their 'reference' large-caps.\n\nConfused? Of course you are, because you haven't done THE INVESTING MASTERCLASS LESSONS yet. Its fully explained there.\n\nYou'd understand this system if you did all the lessons. \n\nUntil then the brilliance of this system is probably wasted on you.\n\nThe Masterclass can be found 2 channels after this one.\n\n\n\n***How do I follow it?***\n\n> The relative strength portfolio strategy is a 'long-only' strategy, which means it should be followed using spot positions.\n> \n> Large-cap tokens will be easy to find on any major exchange.\n> \n> Small-cap tokens can be found by going to __CoinGecko.com__ and searching up the 'Exchanges/Markets'.\n> \n> Should you find two small-cap tokens under the same name, the one you should be buying is always the one with the largest market cap.\n> \n> We do not perform ultra-low-cap pump-and-dumps in this university.\n\n\n\n\n***How will it behave?***\n\n> Depending on how strong the market is, it will hold positions that should allow it to out-perform $TOTAL on the upside, this is its benchmark.\n> \n> Sometimes it will just hold BTC & ETH and no small-caps in up-trends where the dominance of majors is strong and rising.\n> \n> Other times it will hold a huge amount of small-caps relative to large-caps when $OTHERS is strong and rising.\n\n\n\n\n***How much money will I make / What returns can I expect? ***\n\n> I cannot predict the future, and no one else can either.\n> \n> Due to the bespoke nature of the TPI and the extreme complexity of the Relative Strength Portfolio which uses it, no back-test exists.\n> \n> Students are welcome to go back through the signals channel history and collect all the 'forward tested' data for themselves.\n> \n> With all that being said, I anticipate the portfolio to 10x over the next 2 years, with most of the returns clustered around the next bull market.\n\n\n\n\n***Who should follow the Relative Strength Portfolio Strategy?***\n\nInvestors who: \n\n> 1. Want superior long-only performance and don't mind updating their holdings frequently.\n> \n> 2. Are comfortable with using multiple exchanges, both centralized and decentralized.\n> \n> 3. Want exposure to highly 'robust' and 'reliable' performance over the course of years.\n\n\n\n\n***Summary:***\n\n> If the TPI is the 'hammer' of my investing toolkit, the Relative Strength Portfolio Strategy is the 'axe'.\n> \n> Slightly more dangerous and difficult to use, but still very simple, reliable, and practical.",
         "section_url":null,
         "section":"summary",
         "image_path":null,
         "delete":"1"
      }
   ]
}