{
   "channel_id":1146272956486529065,
   "channel_name":"🎭┃financial-literacy",
   "sections":[
    {
        "content": "||**“Stay Persistent. God despises sloth.”**||\r\n•\r\n\r\n\r\n                                                                                                                                                                                           \r\n\r\n> **Congratulations, you completed** <#1146272956486529065>.\n\r\n> \r\n> \r\n> On to the next channel <#1144117302548246609>.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete": "1"
    },
    {
        "content": "🎭 **Financial Literacy** 🎭 \n\n\"Money Isn't Real: 1 - Introduction\"",
        "section_url": "https://vimeo.com/859729857/ece1fa6118?share=copy",
        "section": "video",
        "image_path": null,
        "delete": "1"
    },
    {
        "content": "What is the point of this lesson series?\n\nA In the end, you’ll realize that all your work will be rewarded with something that doesn’t exist.\nB In the end, you will understand money at a deeper level than 99% of adults out there. -\nC In the end, you will understand how rich people avoid taxes.",
        "section_url": null,
        "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
    },
    {
        "content": "•\n﻿\n﻿\n﻿\n﻿\n> 🎭 **Financial Literacy** 🎭 \n> \n> \"If you skip the video I WILL personally task a witch to curse you and your family for the next 7 generations.\" \n>",
        "section_url": "https://vimeo.com/859726766/1edcd7f194?share=copy",
        "section": "video",
        "image_path": null,
         "delete":"1"
    },
    {
        "content": "What is the gold standard?\n\nA That's when the world's top economists get together and try to solve a financial crisis, so that every nation’s citizens can live and prosper.\nB The gold standard is when the government hires a group of dwarves to dig for gold 24/7 and use it to power the country's economy. It's like 'The Hobbit' but with more inflation\nC At a certain point in history money was pegged to the amount of gold that a country had. If a country wanted to print more money, it would have to own the gold to back it up. -",
        "section_url": null,
        "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
    },
    {
        "content": "•\n﻿\n﻿\n﻿\n﻿\n> 🎭 **Financial Literacy** 🎭 \n> \n> \"If you skip the video I WILL enlist a midget Terminator and send it back in time to find (and terminate) your ancestors. \" \n>",
        "section_url": "https://vimeo.com/859727632/d5475e553c?share=copy",
        "section": "video",
        "image_path": null,
         "delete":"1"
    },
    {
        "content": "What is fractional reserve banking?\n\nA It’s when banks keep only a fraction of the money in reserve and use the rest to fund charity work.\nB Fractional reserve banking is a system where banks only accept deposits in fractions of time, leading to an unpredictable and confusing currency exchange rate.\nC It’s a clever scheme banks use to create money out of thin air. They take only a small portion of customers’ deposits and lend out the rest, knowing full well that not all customers will want to withdraw their funds at the same time. -\nD This allows banks to create more loans and make more money while putting customers' deposits at risk. It's basically legal counterfeiting.",
        "section_url": null,
        "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
    },
    {
        "content": "•\n﻿\n﻿\n﻿\n﻿\n> 🎭 **Financial Literacy** 🎭 \n> \n> \"If you skip the video I WILL sell all my worldly possessions and go to Tibet so I can start training with the League of Shadows. \n> \n> A few years from now you won't even remember skipping this video. You'll be living your life in peace until one night a man in a Bat costume bursts through your window, right into your bedroom and he proceeds to beat you up.\n> \n> That man will be me.\" \n>",
        "section_url": "https://vimeo.com/859728283/abaeebadbc?share=copy",
        "section": "video",
        "image_path": null,
         "delete":"1"
    },
    {
        "content": "Who runs the central banks and how are they chosen for the job?\n\nA Central banks are actually run by a shadowy cabal of wizards who meet in secret to discuss monetary policy and cast spells to control the economy.\nB Central banks are overseen by people nominated by at least 10 electors from the constituency they wish to represent. They also need to pay a $500 deposit which they get back if they get more than 5% of the total votes in their constituency.\nC Central banks are typically overseen by a board of directors or governors, who are appointed by the government or other relevant authorities. In some cases, the central bank governor may also be appointed by the country's head of state or elected official -",
        "section_url": null,
        "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
    },
    {
        "content": "•\n﻿\n﻿\n﻿\n﻿\n> 🎭 **Financial Literacy** 🎭 \n> \n> \"If you skip the video I WILL call ALL of my psycho ex girlfriends and tell them that I'm willing to marry them on one condition:\n> \n> \"bring me the balls of the man that skipped this video\"\n> \n> They will then hunt you down and harvest your balls.\n> \n> So just watch the video. Your balls are on the line.\" \n>",
        "section_url": "https://vimeo.com/859729198/e6f1d20581?share=copy",
        "section": "video",
        "image_path": null,
         "delete":"1"
    },
    {
        "content": "How can you become better at making money?\n\nA You should focus on improving your skills. Trying to make money without skills is like trying boxing with no hands. -\nB You should learn how to create a truly impressive CV and apply for a higher-paying job.\nC People that had very tough upbringings have an advantage when it comes to succeeding later on in life. If you had loving parents and a good safety net you will never become rich. Unless you were born rich already of course.",
        "section_url": null,
        "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
    }
]}