{
   "channel_id":1131759012086550612,
   "channel_name":"ðŸƒðŸ½â”ƒiron-body-cardio",
   "sections":[
    {
        "content": "**Iron Body Program** 🦿 \n\nThe training program that you will discover in the following was specially designed to increase muscle mass and give your body the most aesthetic shape possible.",
        "section_url": null,
        "section": "attachment",
        "image_path": "attachments/🏃🏽┃iron-body-cardio/Iron_Body_Program_photo_1.png",
        "delete":"0"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃The Layout**\n\nExperience has taught me that simple things are best for optimal results when it comes to training and nutrition.\n\nThe current program is a protocol that must be followed 100% for best results.\n\n\n__This program is divided into 2 parts:__\n\n> The first part is the **cardio session** that you have to do **every morning** for 5 consecutive days.\n> \n> The **best time** to do it is from 7 am. If you can't get up that early, try 8am or at least 9am.\n> \n> The **second part** of the program is weight training.\n> \n> The best time to do it is from **5 p.m.**",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃What Regimen is ideal for building muscle mass?**\n\n> For people looking to build muscle mass, aerobic exercise, also known as cardio exercise, is not usually considered the best type of exercise for building muscle mass.\n> \n> Aerobic exercise is designed to increase your heart rate and improve cardiovascular endurance rather than build muscle.\n> \n> Resistance training, such as lifting weights or bodyweight exercises, is more effective for building muscle mass.\n> \n> However, incorporating aerobic exercise into your routine can have various health benefits and improve overall fitness.\n> \n> The energy for aerobic exercise is obtained by the body by burning fat.\n> Energy for anaerobic exercise is obtained by the body by burning glycogen, the body's sugar.\n> \n> Due to the explosive nature of anaerobic exercise, the body is prohibited from using its fat stores for energy.\n> \n> It's highly recommended you participate in both. The Cardio and Weight sections for optimal benefits.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"0"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃1**\n\n> Doing aerobic activity along with intense weight training exercises will give you amazing results.\n> \n> All the top athletes in the world today incorporate aerobic activity into their training programs. It is an amazing fat burning system with many cardiovascular benefits.\n> \n> You should do cardio every morning from 7:00 to 8:00 after drinking lemon water.\n> This type of training is recommended 5-6 times a week.\n> \n> The best time to do your aerobics program is first thing in the morning and on an empty stomach.\n> \n> This is the best way to deplete fat stores.\n> \n> When you're doing aerobic exercise, it's important to remember that you're doing it to lose fat.\n> \n> To do this, you should not overdo it, otherwise the body will start using muscle mass for energy.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃Cardio Benefits** \n\nAerobic exercises has the following benefits:\n\n> ⦁ **Improved heart health:** Regular aerobic exercise can strengthen your heart and improve cardiovascular function, reducing the risk of heart disease and stroke.\n> \n> ⦁ **Better lung function:** Aerobic exercises can improve lung capacity and function.\n> \n> ⦁ **Weight management:** Aerobic exercises can help you lose weight or maintain a healthy weight by burning calories and promoting fat loss.\n> \n> ⦁ **Increased endurance:** Regular aerobic exercise can increase your endurance and stamina, making it easier to perform daily activities.\n> \n> ⦁ **Improved mental health:** Aerobic exercises can have a positive impact on mental health by reducing stress, anxiety, and depression and improving mood and self-esteem.\n> \n> ⦁ **Better sleep:** Aerobic exercise can help improve sleep quality and duration.\n> \n> ⦁ **Increased energy levels:** Aerobic exercise can increase energy levels by improving cardiovascular function and oxygenation of the body.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃Cardio Workout**\n\nFor your cardio workout, you can choose one of the following and do it for 20 to 30 minutes.\n\n> ⦁ **Brisk walking: **A low-impact exercise that can be done almost anywhere and is suitable for people of all fitness levels.\n> \n> ⦁ **Jogging:** A moderate-intensity exercise that can improve cardiovascular fitness, balance, and coordination.\n> \n> ⦁ **Cycling:** A low-impact exercise that is easy on the joints and can improve cardiovascular fitness and muscle strength.\n> \n> ⦁ **Swimming:** A low-impact exercise that provides a full-body workout and can improve cardiovascular fitness, muscle strength, and flexibility.\n> \n> ⦁ **Rowing:** A high-intensity exercise that can improve cardiovascular fitness and muscle strength.\n> \n> ⦁ **Step aerobics:** A high-intensity exercise that improves cardiovascular fitness and coordination.\n> \n> ⦁ **Elliptical trainer:** A low-impact exercise that can improve cardiovascular fitness and muscle strength.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃2**\n\nAfter you finish the cardio session, do 10 to 15 minutes of stretching.\n\nStretching has several benefits for physical and mental health, including:\n\n> ⦁ **Improved flexibility:** Regular stretching can increase flexibility and range of motion, reducing the risk of injury and improving athletic performance.\n> \n> ⦁ **Reduced muscle soreness:** Stretching can help reduce muscle soreness and stiffness, especially after exercise.\n> \n> ⦁ **Improved posture:** Stretching can help improve posture by increasing the flexibility of muscles and reducing tension in tight areas.\n> \n> ⦁ **Improved circulation:** Stretching can improve blood flow and circulation, reducing the risk of blood clots and varicose veins.\n> \n> ⦁ **Reduced stress and anxiety:** Stretching can help reduce stress and anxiety by promoting relaxation and reducing muscle tension.\n> \n> ⦁ **Improved balance and stability:** Regular stretching can improve balance and stability, reducing the risk of falls, especially in older adults.\n> \n> ⦁ **Increased energy levels:** Stretching can increase energy levels by promoting relaxation and reducing muscle tension.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Iron Body Program┃Stretches, and why they're good for you**\n\nStretching has several benefits for physical and mental health, including:\n\n> ⦁ **Improved flexibility:** Regular stretching can increase flexibility and range of motion, reducing the risk of injury and improving athletic performance.\n> \n> ⦁** Reduced muscle soreness:** Stretching can help reduce muscle soreness and stiffness, especially after exercise.\n> \n> ⦁** Improved posture:** Stretching can help improve posture by increasing the flexibility of muscles and reducing tension in tight areas.\n> \n> ⦁ **Improved circulation:** Stretching can improve blood flow and circulation, reducing the risk of blood clots and varicose veins.\n> \n> ⦁ **Reduced stress and anxiety:** Stretching can help reduce stress and anxiety by promoting relaxation and reducing muscle tension.\n> \n> ⦁** Improved balance and stability:** Regular stretching can improve balance and stability, reducing the risk of falls, especially in older adults.\n> \n> ⦁** Increased energy levels:** Stretching can increase energy levels by promoting relaxation and reducing muscle tension.\n> \n> Here are some examples of common stretching exercises after you finish the cardio session:\n> \n> ⦁ **Hamstring stretch:** Stand with feet hip-width apart, bend forward at the hips, and reach towards your toes. Hold the stretch for 15-30 seconds.\n> \n> ⦁ **Quad stretch:** Stand with feet hip-width apart, bend your right knee, and bring your heel towards your butt. Hold the stretch for 15-30 seconds. Repeat on the other side.\n> \n> ⦁ **Calf stretch:** Stand with feet hip-width apart, step forward with one foot, and bend the front knee while keeping the back leg straight. Hold the stretch for 15-30 seconds. Repeat on the other side.\n> \n> ⦁ **Tricep stretch: **Stand with feet hip-width apart, extend one arm overhead, bend the elbow, and reach towards your upper back with the other hand. Hold the stretch for 15-30 seconds. Repeat on the other side.\n> \n> ⦁ **Shoulder stretch:** Stand with feet hip-width apart, interlace your fingers behind your back, and lift your arms up towards the ceiling. Hold the stretch for 15-30 seconds.\n> \n> ⦁** Butterfly stretch:** Sit on the floor with the soles of your feet together, hold your feet with your hands, and gently press your knees down towards the floor. Hold the stretch for 15-30 seconds.\n> \n> ⦁ **Chest stretch:** Stand with feet hip-width apart, clasp your hands behind your back, and gently pull your arms back and up, feeling a stretch in the chest and front of the shoulders. Hold for 15-30 seconds.\n> \n> ⦁ **Cat-cow stretch:** Start on your hands and knees, with your wrists under your shoulders and your knees under your hips. As you inhale, arch your back and lift your head and tailbone towards the ceiling. As you exhale, round your back and tuck your chin to your chest. Repeat for several breaths.\n> \n> ⦁ **Downward-facing dog:** Start on your hands and knees, with your wrists under your shoulders and your knees under your hips. Lift your hips up and back, extending your arms and legs, and pressing your hands and feet into the floor. Hold for 15-30 seconds.\n> \n> ⦁ **Seated forward bend:** Sit on the floor with your legs extended straight in front of you, reach forward and try to touch your toes, holding onto your ankles or shins. Hold for 15-30 seconds.\n> \n> ⦁ **Lizard stretch:** Start in a push-up position, bring your left foot outside your left hand, and hold for 15-30 seconds. Repeat on the other side.\n> \n> ⦁ **Pigeon stretch:** Start on your hands and knees, bring your right knee towards your right hand, and extend your left leg straight behind you. Hold for 15-30 seconds. Repeat on the other side.\n\nThese are just a few examples of stretching exercises. It's important to stretch regularly and hold each stretch for at least 15-30 seconds to reap the benefits.\nAs with any exercise, it's important to listen to your body and move within your own range of motion to avoid injury.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "•\n\n\n\n\n# **Conclusion**\n\nCardio is more efficient in fat burning, compared with high-intensity training, which burns muscular glycogen (carbohydrates).",
        "section_url": null,
        "section": "attachment",
        "image_path": "attachments/🏃🏽┃iron-body-cardio/Conclusion.png",
        "delete":"0"
    },
    {
        "content": "•\r\n\r\n\r\n\r\n\r\n> **The Fitness Campus** - Cardio 💪🏽\r\n>",
        "section_url": "https://vimeo.com/859621345/e18ad2263f?share=copy",
        "section": "video",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "||**“Make History.”**||\r\n•\r\n\r\n\r\n\r\n\r\n> **Congratulations, you completed** <#1131759012086550612>.\n> \r\n> \r\n> On to the next channel <#1131765722528354434>.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    }
]}