{
   "channel_id":1075430835559342110,
   "channel_name":"🌸┃economic-season",
   "sections":[
      {
         "content":"Macroeconomic update to classify why economic **\"AUTUMN\"**🍂  is still in effect.\n‎\nAs you can clearly see there has been no movement outside the deflationary quadrant of the GRID model.\n‎\nWhile there can, and will, be moves in both directions, it's critical to remember that the destiny of this market is DOWN due to the nature of the long term credit cycle, even though the liquidity cycle may see temporary jumps to address short term systemic risks (banking insolvencies).\n‎\nBanking problems handled in the short term (Q2~Q3) via backstops/liquidity injections do not constitute a new 'bull market' regardless of how much FOMO you see on twitter. It doesn't mean it can't be used to invest, however its critical to keep a level head.",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"Summary: Late 2023 ~Q4 is approaching the realm of maximum risk, market movements until then will continue to move in both directions with a bias of DOWN multiplied in probability by time.",
         "section_url":null,
         "section":"summary",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"The economic season is now 🌸 SPRING 🌸\n‎\nA gentle breeze begins to blow... in 🌸Spring🌸, the frosty winds that startled investors during Autumn begins to fade. Every rise continues to be questioned, until eventually, they aren't.\n‎\nInvestors who are new to the scene watch the buds sprout and bloom, mesmerized by the spectacle, hearts filled with the exhilaration of promise.\n‎\nExperienced investors, with past seasons etched into their minds, can't help but anticipate the sweltering heat of the summer that lies ahead over a much longer time horizon.\n‎\nIn Spring, markets climb a wall of worry with hesitant optimism, generally gravitating towards the upside, while still maintaining the risk of sudden downside.\n‎\nIn Spring, markets transition from a survival mode to a state of harmony which provides a weak safety net for the inexperienced, shielding them from some of the harsh consequences of their hubris.\n‎\nWhile the possibility of winter still looms, supernatural forces outside the control of the economic seasons suggest Summer is an increasing probability.\n‎",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"‎\nAs I explained in the GRIDS lesson above, there appears to be a delicate balance between goldilocks and deflation currently.\n‎\nOn the goldilocks side we have the resilient US & global economy with high employment levels and moderate growth. On the deflation side we have the relentless contractionary pressures caused by higher interest rates.\n‎\nOf the 3 factors that drive macroeconomic asset sentiment the most, we understand that if growth and inflation do not provide strong signals, the most powerful factor of all, liquidity, will be the tiebreaker.\n‎\nSo what are liquidity trends?\n‎\nPut concisely, liquidity down in the very short term (this post will become obsolete quickly, ensure you’re reading <#1075430627907752040> daily to catch updates on this), but liquidity up significantly in the longer term (several months to just over a year).",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"Short term rationale? Two liquidity models from 42 macro and their associated quantitative trend models. (Mainly 'global' liquidity)",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"Long term rationale? Comprehensive analysis from Crossborder capital, who Darius himself has suggested knows more about liquidity science than he does.\n‎\nI'll present his research from longest-term to shortest-term (again, updates will be provided in <#1075430627907752040>",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"Exhibit 1 - The global liquidity cycle",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"Exhibit #2 - The GLI, which is used to track the cycle",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"And finally, Exhibit #3 - A projection of where the GLI will be most likely to move in the coming months.",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"Update to the **GRIDs.** No major changes in <#1075430835559342110>  implications as the majority of the effects will be coming from liquidity. Inflation globally is coming in very dovish. This is continued positive data for long term investors.",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/image.png",
         "delete":"0"
      },
      {
         "content":"There has been a significant change to the GRIDs model. I covered this I believe 2-3 days ago in one of the <#1075430627907752040> videos. Effectively the GRID regime is now REFLATION with a slight bias towards INFLATION in the coming months.\n\nThis is not entirely bearish, however it could be construed as slightly bullish should global liquidity continue to increase at a fast pace, which I don't anticipate over the next ~3 months.",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/🌸┃economic-season/graph.png",
         "delete":"0"
      }
   ]
}