{
   "channel_id":1146059327183003678,
   "channel_name":"ðŸ€â”ƒdiscretionary",
   "sections":[
    {
        "content": "**The Masterclass** 🎖️ \n\nModule 6 - \"Discretionary Investing & Bonus Lessons\" ☘️",
        "section_url": "https://vimeo.com/856464824/8e558c2575?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 49**",
        "section_url": "https://vimeo.com/856458437/2884b6fcba?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n> Always be thinking of wider market variables you could use to complete this analysis. You never know what data set might have a repeating relationship to the BTC cycles you're looking for.\n\n> On-chain, macro, statistical price data, asset correlations.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 50**",
        "section_url": "https://vimeo.com/856462094/a966e30296?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 51** - Qualitative Analysis (Alpha Hunting)",
        "section_url": "https://vimeo.com/856536295/c4babd0e06?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "It is my personal opinion that qualitative analysis is dangerous because it's an intellectually attractive endeavor that strokes peoples egos.\n\nSitting around discussing 'things' makes people feel smart without actually doing any work. You can talk for HOURS about something and never reach an actionable or measurable conclusion.\n\nQualitative analysis only works when you have a LIFETIME of hard-won experience in the field you're working in. \n\nAre you in the top 1% of all crypto technologists, investment managers, and financial analysis on earth?\n\nProbably not, neither am I. So you should ***use this lesson for informational and curiosity purposes only.***\n\n\n***Its highly recommended that you do not use this information as a system.*** <:red_pill:1130225558106677319> \n•\n\n\n\n\n***What is 'alpha'?***\n\n> 'Alpha' is defined as the additional investing performance one can achieve as a result of unique, intelligent, exclusive or sophisticated research.\n\n> When you exploit opportunities in the market that no one else can find, you are said to 'capture alpha'.\n\n> When you share these opportunities you are said to 'give alpha'.\n\n***Categories of alpha:***\n\n> Quantitative & Qualitative.\n\n> The investing masterclass already teaches you all about quantitative alpha.\n\n> Therefore this lesson teaches the basics of qualitative alpha. The type that most people get wrong.\n\n> Most of the time the token narrative doesn't matter, sometimes it's the ONLY thing that matters\n\n> Qualitative alpha is the type of alpha that causes tokens to go up 10x in a week.\n\n> Qualitative alpha is also the type of alpha that causes tokens to go down -99% in a day.\n\n> Where there is volatility, there is opportunity. This is why qualitative analysis can be important.\n•\n\n\n\n\n***Principles of qualitative alpha #1: SPEED***\n\n> Information that everyone has is not qualitative alpha.\n> Information that only you have because you worked FASTER than everyone else is alpha.\n> Information only you have, but don't ACT upon, is useless, and may as well not be alpha.\n\n> Opportunities to use qualitative alpha often evaporate quickly. \n\n> Some opportunities expire after minutes (not an exaggeration). \n\n> Some opportunities need to be taken months before anyone else even knows they exist.\n\n> Also, if you can discover the information required to make big money but you hesitate, you may as well have never done the research.\n\nSPEED IS KEY, YOU NEED BOTH:\n> SPEED OF RESEARCH\n> SPEED OF ACTION\n\n***Principles of alpha #2: Market Environment***\n\n> IT DOESN’T MATTER HOW GOOD A PROJECT IS, IF YOU’RE IN A BEAR MARKET, ITS TRASH.\n\n> No amount of good fundamental factors can cause a token to 10x in a bear market. \n\n> Understand that you want to be looking for moonshots and adoption narratives in a bull market. \n\n> This is when it is PvE (easy mode) and all you have to do is buy rumors. All market segments (DeFi, NFT) basically go up at the same time. A rising tide lifts all boats.\n\n> Understand you want to be looking for impending catastrophes in a bear market. \n\n> When it is PvP (hard mode) trends are much harder to spot than in PvE if there is any at all. You have to dig much deeper and have a much better understanding than other pro players to find something before them. Usually that 'something' is a project blowing up so you can short it and make money from it's annihilation.\n\n***Principles of alpha #3: Don't drink the kool-aid!***\n\n> NEVER GET TRICKED INTO DIAMOND-HAND HOLDING SHIT.\n\n> You must be smart enough to detect, see, adopt the narrative, and fundamental factors while simultaneously remaining emotionally separated from them.\n\n> If you find yourself feeling upset when someone says your idea is bad, or feeling happy that someone agrees with you, you should sell everything and re-assess your ability to stay unattached to the analysis.\n\n> Emotions have no place in investing. \n\n> Ask yourself: Have I missed anything with my analysis? Am I operating off hope, or actual intelligence?",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "***Principles of alpha #4: Narrative Saturation***\n\n> When looking for a narrative, you want to be looking in places where the crowd ISN'T LOOKING.\n\n> The crowd isn't smart, token projects that are the NEW COOL THING are usually in the process of peaking (i.e. you're about to lose your money, rather than make some).\n\n> If no one is talking about an idea that you're exploring: Good.\n\n> If people are completely uninterested in your thesis: Good.\n\n***Principles of alpha #5: Narrative Momentum***\n\n> Tying into narrative saturation... when finding an emerging narrative, or catalyst, you need to be forming some kind of expectation about the momentum of the narrative.\n\n> If you find a tweet for a project has 10 likes, then 10 likes on another tweet posted a week later, there's no momentum.\n\n> If a token project gets 10 likes per tweet week one, then 50 likes per tweet the next week, YOU BETTER BE WORKING WITH SPEED.\n\n> This is an indication of narrative momentum speeding up and its time to ACT on your fundamental thesis.\n\n***Principles of alpha #6: Narrative Depth (1/2)***\n\n> This one is very complex and is often where the majority of alpha is found.\n\nTHINK: ***CHESS***\n\n> If you don't know how to think multiple moves ahead you will not be able to capture the biggest alpha.\n\n> Example: A number of intercontinental ballistic missiles randomly strike the largest oil refineries in the world at the same time.\n\n> 99% of the 0-depth, narrative chasing tourists who cannot think for themselves: \n\n> \"Damn, I better buy some $OIL token because the price of oil is going to go up!\"\n\n> 1% Top-tier Qualitative Alpha Hunters who drive Bugattis: \n\n\"If Oil prices quadruple due to a war, transportation costs moon and shipping companies won't be able to provide affordable freight capacity. Because the cost of intercontinental transport is now too high, small domestic industries which were previously crowded out by cheap foreign manufacturing (pharmaceuticals, durable industrial goods) are more profitable. I'm going to buy $DRUG & $TOOL token because these companies are going to share in the increased profits of our domestic pharmaceuticals and durable industrial goods industries\"\n\n***Principles of alpha #6: Narrative Depth (2/2)***\n\n> WARNING: DO NOT PUT ON THE TIN FOIL HAT TOO TIGHTLY\n\nThinking outside the box and coming up with creative and super deep ideas is fantastic, however if you go too deep, you might be holding onto something for years waiting for people to recognize your brilliance.\n\nSaid another way, if your ideas are too obscure, they may not ever materialize.\n\nThe highest likelihood of success when going deep is to either:\n\n> 1. Find things early that the stupid people will find later, this means the 'alpha' is easy for other people to find at a later time.\n\n> 2. Find things which the money must flow into at a later time as a result of your analysis because late investors wont have a choice, thus avoiding the discovery problem.\n\n***Principles of alpha #7: The Team***\n\n> The behavior of the people working on these projects are usually the best indication of what can go right or wrong.\n\n> If they are scammers but people don't know that yet, you can short the token before anyone else.\n\n> If they are hard workers who innovate quickly and have a good track record, but people don't know that yet, you can buy before anyone else.\n\n> You can have the greatest idea in the world, but if the team is shit, it has no hope. \n\nHuman quality = the result.\n\n> The reason why good teams are hard to find is because the incentives are usually there for them to scam.\n\n> Default assumption is that they are trying to scam the world.\n\n> Only assume high quality when you can see them doing real improvements and making sacrifices.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "***Principles of alpha #8: Tokenomics***\n\n> If you’re dealing with a hyperinflationary ponzi, it’s going to go to zero. This is basically what fiat currency is.\n\n> If you’re dealing with something like BTC, the dynamics are favorable because there is a conservative and fixed schedule.\n\n> If you’re dealing with something that has utility AND deflationary dynamics, like ETH, then you have economic and financial physics working in your favor.\n\n> Always check you’re not getting sucked into an inflationary ponzi: Some developers mint themselves tokens and dump on you. This costs them nothing but makes them an infinite amount of money provided there are always naive buyers (XRP etc.).\n\n***Principles of alpha #9: Total value locked ***\n\n> TVL is a measurement of the total commitment investors have to the project.\n\n> If people are willing to lock up millions of dollars, there is a good chance that they are confident in the reward and security prospects of the project.\n\n> If people are only willing to lock up a small amount, and only for a short time, its likely they are participating in ponzis and they are destined to fail.\n\n***Principles of alpha #10: Rate of network growth***\n\n> The rate of network growth can either be the growth of the host network that the project is on, or it can be the network that the project has created.\n\n> Either way adoption over different periods of time can signify an increase in the sentiment for that network, which may result in flow-on effects for related projects.\n\n> An example would be, if you had an increase in adoption for Arbitrum, you’d be more confident in your investment in a new project which was exclusive to the Arbirtum network.\n\n> Caution must be taken so that a bull market is not being misconstrued as high quality adoption, often bull market hype can conceal lack of quality.\n\n***Principles of alpha #11: Defense against competitors***\n\n> In an environment where anyone can clone any other project, a project must have defense against copy cats. This makes a MOAT important. \n\n> A moat for a business is like a moat on a castle: What is unique about the dynamics of the project that protect it from attacks by competitors?\n\nMoats can be:\n> First mover advantage leading to insurmountable network effects\n\n> Reputational advantage & known \n> security\n\n> Switching costs for users\n\n> Established brand identity through community and promotional effects\n\n> When the previous effects are in place, innovation can play a role",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n***Real example of alpha (1/2):***\n\n> November 7th 2022: CZ, the CEO of Binance, announced he would be liquidating all of Binance's holdings of $FTT, the native token of competing crypto exchange FTX.\n\nIt is reasonable to assume, that CZ has insight into the crypto market dynamics which we do not have (experience, informational advantages, team). \n\nConsidering he had held the $FTT the entire way through the bear market up until now, it was reasonable to assume that the liquidation of the tokens was not due to overall market beta speculation, or else he would have sold them higher.\n\nThe remaining explanation is that there was an extreme additional risk should he not sell the $FTT token. Extreme, because 100% of the position was liquidated.\n\nNot 10%, not 50%. 100%.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "***Real alpha example continued (2/2):***\n\n> Due to $FTT being the 'stock' of FTX, extreme risks in the token reflect extreme problems with the underlying business. \n\nWhen there are extreme problems with an exchange, they go bankrupt. Bankrupt exchanges 'bail-in' their clients deposits.\n\nIf there's a risk your deposits on FTX might get 'bailed-in' and the 'cost' to avoid losing -100% of your capital is simply to pay a $5 transaction fee to move your capital to another exchange, it's logical to remove your capital from FTX.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "***'SPEED'***",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "***Where to find alpha?***\n\nTwitter/X is undoubtedly the best place in the world right now to find alpha.\n\nThe things you see on twitter/X you can get instantly, for free, and usually do not show up in mainstream-media for days.\n\nIf you are following accounts with a good reputation and the accounts which are relevant to your niches, you'll likely be among some of the first people to get critical information.\n\nNo, there is not a magical list of accounts that act as an easy source of alpha.\n\nIf you're reading this thinking 'Great, just tell me the right accounts to follow and I'll find alpha', then you're misunderstanding a critical part of this game...\n\nYou never know where the alpha is going to come from. It doesn't always come from twitter. This is the whole point. This is what makes alpha, ALPHA. \n\nIt's very hard to find.\n\n> Sometimes it comes from business reports released by investment banks. \n> Sometimes it comes from websites that produce asset reports. \n> Sometimes it comes directly from hedge-funds in the form of a newsletter.\n> Sometimes it comes from your network of well-connected insiders, if you're lucky to have such a network.\n\nI used to use SeekingAlpha.com (aptly named) many years ago. Many of my best ideas at the beginning of my career came from there.\n\nOverall, there is no single 'source of alpha'. If there was it would become crowded and the 'alpha' would vanish.\n\nIts like smoke: The harder you try to keep it in one place, the faster it disappears.\n\n***Examples of bad/no alpha:***\n\n> Example #1: \"Hi, I heard XRP is going to overtake the banking system. That means it's market cap is going to grow bigger than BTC\"\n\nProblem: This is an atrociously bad statement. Where is the proof? Show the evidence, connect the dots? Have you addressed all the points we've spoken about? Have you covered ANY of them? Lazy and nonsensical. Don't do this.\n\n> Example #2: \\Posts link of video with no comment\\\n\nProblem: A point presented without thought, can be ignored without thought. No one in your life is going to give enough of a shit to think FOR YOU. You must THINK FOR YOURSELF. Provide a complete breakdown of your ideas.\n\n***Format for how to present your ideas to other investors:***\n\n*Idea Type: Qualitative or Quantitative?*\n> Qualitative is narrative based, and/or logic derived.\n> Quantitative is the discovery of new and important data.\n\n*Magnitude: How powerful you think the effect is? (1-10)*\n> 10 = Affects the whole market in a major way: e.g. Large exchange collapse.\n> 5 = Something that could multiply other effects but may not have a meaningful effect by itself.\n> You should not be posting anything below a 5.\n\n*Urgency: How soon must this be acted upon? (1-10)*\n> 10 = Must be acted upon immediately. Likely to decay within minutes. (Stablecoin de-pegging)\n> 5 = Must be acted upon with some sense of urgency, but can possibly be valid for another 24-48 hours. (Cluster of leading data releases suggesting economic growth is speeding up)\n> 1 = Long term effect lasting for months, or potentially over a year (Ethereum's deflationary ultra-sound money narrative)\n\n*TL;DR of your hypothesis / Summary of idea.*\n> VERY SHORT\n> No longer than 1 or 2 sentences.\n\n*Full hypothesis:*\n> Complete explanation of idea.\n> KEEP IT TO THE POINT. We want to understand, not read a novel.\n\n*How we can profit from this information:*\n> The steps one must take to profit from this alpha.\n> Be specific.\n> Is there an extensive airdrop or farming process one needs to go through? Explain it.\n> Is a spread-trade required? Which assets are you using to represent the idea?\n\n*Resources:*\n> Please do not post links. Instead synthesize the data for your audience; Include tables & diagrams. \n\nNo one wants to see your technical analysis.",
        "section_url": null,
        "section": "summary",
        "delete": "0"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 52**",
        "section_url": "https://vimeo.com/856424471/d015cc527a?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 53**",
        "section_url": "https://vimeo.com/856494514/bffda9800a?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 54** - Avoid destruction via taxation",
        "section_url": "https://vimeo.com/856456854/a37969b08d?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 55** - Speculative Breakout Trading (1/2)",
        "section_url": "https://vimeo.com/856538355/cb5afe8c81?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n**The Masterclass 56** - Speculative Breakout Trading (2/2)",
        "section_url": "https://vimeo.com/856537568/dc09456b9d?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "•\r\n\r\n\r\n\r\n\r\n> **The Masterclass** - Discretionary 🎖️ \r\n>",
        "section_url": "https://vimeo.com/859621345/e18ad2263f?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "||**“Lord, protect me from my friends; I can take care of my enemies. Voltaire, 1694-1778”**||\r\n•\r﻿\r\n﻿\r\n\n﻿\r\n> **Congratulations, you completed** <#1146059327183003678>.﻿\n> \r\n> \r\n> On to the next channel <#1142404394067963966>.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    }
]}