{
   "channel_id":1088221339564900423,
   "channel_name":"options-watchlist",
   "sections":[
      {
         "content":"Good morning, here is my watchlist today! I am looking at AMD, CRWD, and Netflix puts! \n\n**AMD**\n\n1. Trigger- On the daily timeframe on Friday we had a straight bearish marbuoza candle! If we can hold below Friday lows, ours can be in play!\n\n2. Trend- We are in a hourly and fifteen minute downtrend\n\n3. Entry- For put’s, we enter off lower highs, bear flags, and break and retest\n\n**CRWD** \n\n1. Trigger- On the daily timeframe we have a sell setup forming! Confirmation will be below Friday’s low for trigger for puts!\n\n2. Trend- We are in a hourly and fifteen minute downtrend\n\n3. Entry- For put’s, we enter off lower highs, bear flags, and break and retest\n\n**Netflix**\n\n1. Trigger- On the daily timeframe we have a sell setup forming! Confirmation will be below Friday’s low for trigger for puts!\n\n2. Trend- We are in a hourly and fifteen minute downtrend\n\n3. Entry- For put’s, we enter off lower highs, bear flags, and break and retest\n\nTrade safe and smart!!",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/113.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Here is the game-plan for today! I am looking at Visa puts and Tesla calls \n\n**Visa**\n1. Trigger- On the daily timeframe we have a shooting star, which is a bearish reversal candle! If we can break yesterday’s low we should continue to the downside\n\n2. Trend- We are in a hourly and fifteen downtrend\n\n3. For puts, we enter off lower highs, bear flags, and break and retest\n\n**Tesla**\n\n1. On the daily timeframe we have a bullish maraboza candle! If we can break above yesterdays highs, I will look to enter\n\n2. Trend- We are in a hourly and fifteen uptrend\n\n3. Entry- For calls, we enter off higher lows, bull flags, and break and retest\n\nHave a great day and make sure to use indexes as gauge to long or short",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0377.png",
         "delete":"0"
      },
      {
         "content":"Contracts went to 2.26 It’s still dropping! Now! Went 1/2 today \n\nTook a 4 percent loss on AMD - ❌ $188\nTook a 20 percent win on AMD ✅ -1116\n\n$928 on the day and $1528 on the week so far!",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0383.png",
         "delete":"0"
      },
      {
         "content":"Good morning, here is my watchlist for today! I am looking at Meta/ Netflix calls & Tesla puts \n\nMeta\nTrigger- On the daily timeframe we have a bull flag breakout looking for continuation today above Friday’s high!\n\nTrend- We are in hourly trend and fifteen uptrend\n\nEntry- For calls, we enter off higher lows, bull flags, and break and retest\n\nNetflix \n\nTrigger- On the daily timeframe we have a buy setup forming and we broke a doji on Thursday on Friday! Looking for continuation today above Friday’s high\n\nTrend- We are in hourly trend and fifteen uptrend\n\nEntry- For calls, we enter off higher lows, bull flags, and break and retest\n\nTesla\n\nOn the daily timeframe, we have a doji and we are breaking below Friday’s low!\n\nTrend- We are in a hourly and fifteen downtrend\n\nEntry- For puts, we enter off lower highs, bear flags, and break and retest\n\nUse indexes as gauge to long or short",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0432.png",
         "delete":"0"
      },
      {
         "content":"For everyone asking me….. I am now on interactive brokers, not Webull……. I am doing a small account challenge with a starting at 5k so a lot of you all can follow more trades that I signal on ⁠live-trading-options \n\nExcited to start this, see you all tomorrow!",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0422.png",
         "delete":"0"
      },
      {
         "content":"**6/28 watchlist:**\n\n$AMD long over 107.22 or short under 105.74\n$SQ long over 64.57 or short under 63.13\n$AMZN long over 130.09 or short under 128.74 \n\nYou can also watch TSLA and see how it reacts at 252.63, if it breaks through we can go long if it rejects then we can short.",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_7240.png",
         "delete":"0"
      },
      {
         "content":"No trades today! Market wasn’t showing me anything worth trading! Cash is a position, see you all tomorrow!",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"6/30 watchlist:\n\n$NVDA long over 416.50 or short under 406\n$TSLA long over 261.53 or short under  253.55\n$OXY long over 59 or short under 58.40\n\nMake sure to use proper risk management, take profits and keep losses small",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_7261.png",
         "delete":"0"
      },
      {
         "content":"7/06 watchlist:\n\n$COIN long over 80.92 or short under 76.19\n$SQ long over 69.40 or short under 67.82\n$SPY long over 442.63 or short under 441.21\n$MSFT long over 342.14 or short under 337.66\n\nDon’t forget you can trade within these ranges or wait for a break out in either direction.\n\nTrade safe, trade smart, take profits and keep your losses small",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_7304.png",
         "delete":"0"
      },
      {
         "content":"No trades today! Market wasn’t showing me anything worth trading! Cash is a position, see you all tomorrow!",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"7/10 watchlist:\n\n$SPY long over 439.07 or short under 437\n$LCID long over 7.73 or short under 6.97\n$MSFT long over 335.33 or short under 333.54\n$COIN long over 81.20 or short under 78.17",
         "section_url":null,
         "section":"general",
         "image_path":null,
         "delete":"1"
      },
      {
         "content":"Good morning here is the game plan for today! CRM, SPY, AMD calls/ Google puts! \n\nCalls \n\nTrigger- On the daily timeframe CRM is gapping above this symmetrical triangle and exploding past targets, being up 3.5 percent in pre-market! SPY and AMD both put on failures to go lower on the daily timeframe and put in hammers, which is a bullish reversal candle\n\nTrend- We are in a hourly and fifteen uptrend\n\nCalls- For entry we enter off higher lows, bull flags, and break and retest\n\nFor Puts\n\nTrigger- On the daily timeframe, Google has a bearish maraboza candle! Want to see confirmation below its low\n\nTrend- We are in a hourly and fifteen downtrend\n\nEntry- For puts, we enter off lower highs, bear flags, and break and retest\n\nSee white lines as confirmation and yellow lines are potential targets! Used indexes to gauge to go long or short",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0681.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Tesla today is on top watch for longs! \n\nTrigger- On the daily timeframe we are showing some relative strength gapping above Friday’s high!\n\nTrend- We are in a hourly and fifteen uptrend\n\nEntry- For calls, we enter off higher lows, bull flags, and break and retest\n\nUse indexes as your gauge to long or short and yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0802.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Today I’m looking at Amazon and CRM puts/ NVDIA calls\n\nTrigger- Amazon and CRM on the daily both have failures to go higher and inverted hammers! Amazon also has a gap to the downside to be filled\n\nTrend- We are in a hourly and fifteen downtrend\n\nEntry- For puts, we enter off lower highs, bear flags, and break and retest\n\nNVDIA \n\nTrigger- Yesterday we bounce from a low and went up 12 dollars closing with no sellers resistance! Daily candle has a hammer and we are gapping above its high!\n\nTrend- We are in a hourly and fifteen uptrend\n\nCalls- For calls we enter off higher lows, bull flags, and break and retest",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0817.png",
         "delete":"0"
      },
      {
         "content":"7/19 watchlist:\n\n$AI long over 42.22 or short under 40.28\n$SOFI long over 9.82 or short under 9.46\n$SQ long over 79.34 or short under 72.57\n\nMake sure to take profits and keep your losses small",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_7405.png",
         "delete":"0"
      },
      {
         "content":"Good morning, here is the watchlist for today! \n\nSnowflake and Tesla calls\n\nTrigger- Both are showing strength and flagging which we want to see! We got some buyers momentum that has pushed these higher\n\nTrend- We Are in a hourly and fifteen uptrend\n\nEntry- For calls, we enter off higher lows, bull flags, and break and retest\n\nUse indexes as your gauge to long or short! Yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0842.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Here is the watchlist for today, Tesla and Msft calls!\n\nTrigger- On the daily timeframe, Tesla failed to go lower and put in a bullish engulfing candle! We are gapping up with volume, so looking for some continuation to the upside!\n\nMSFT has put in a reversal in a downtrend, so a pop up to the upside is what I am anticipating! \n\nTrend- We are in a hourly and fifteen uptrend \n\nEntry- For calls, we enter off higher lows, bull flags, and break and retest \n\nUse indexes as your gauge to long or short, yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0924.png",
         "delete":"0"
      },
      {
         "content":"Game plan for today! SPY & Meta calls! \n\nTrigger- Spy has been failing to go lower and putting in a higher low and recently this bull flag on the daily time frame! Next level is 459. 52, I’ve been in swings since Monday! Let’s see how we open! \n\nMeta is gapping up showing extreme strength of a strong earnings beat! Put in a daily hammer off a pullback with now this explosive move up!\n\nTrend- We are in a hourly and fifteen uptrend\n\nEntry- For Calls, we enter off higher lows, bull flags, and break and retest",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_0964.png",
         "delete":"0"
      },
      {
         "content":"Roku daily falling wedge breakdown, sniped perfectly! 2000 in less than 10 minutes! Signaled in",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_1043.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Here is the game plan for today! I am looking at Amazon and CRWD calls & CRM puts! \n\nTrigger- Amazon and CRWD both put in a failure to go lower pattern and also crowd has a reversal candle, looking for continuation above its previous candle high’s! It is also earning week, so tech can get a push up!\n\nCRM is showing relative weakness, so if the market decides to fail, that will be on my first list to short! \n\nTrend- We are in a hourly and fifteen uptrend for Amazon and CRWD| Downtrend for CRM\n\nEntry- For Calls we enter off higher lows, bull flags, and break and retest! For puts we enter off lower highs, bear flags, and break and retest!\n\nUse indexes as your gauge to long or short, and yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/image.png",
         "delete":"0"
      },
      {
         "content":"Good morning! Here is the watchlist today, I am looking at Tesla, SQ puts// AMD calls\n\nTesla and AMD puts\n\nTrigger- On The Daily timeframe Tesla has a symmetrical triangle breakdown where we are gapping below the triangle showing weakness! SQ has an evening star on the daily timeframe that is looking to get continuation at open today!\n\nAMD calls look good if the market holds, based on us gapping up above on strength! \n\nTrend- We are in a hourly and fifteen downtrend for Tesla and SQ// We are in a hourly and fifteen uptrend For AMD\n\nEntry- For Calls, we enter off higher lows, bull flags, and break and retest! For puts we enter off lower highs, bear flags, and break and retest \n\nUse indexes as your gauge to long or short and yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_1158.png",
         "delete":"0"
      },
      {
         "content":"Netflix longs when market switched! Called in",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_1211.png",
         "delete":"0"
      },
      {
         "content":"Good morning, here is the game plan for today! Apple and SQ puts and Amazon and Tesla calls! Snowflake for calls is honorable mention! \n\nTrigger-  Apple and SQ on the daily timeframe are showing relative weaknesses, Apple missed because of ER and is dropping!\n\nAmazon and Tesla are showing relative strength, Amazon had a great ER beat! \n\nIf we hold, I’m looking for bullish moves, if we drop I’m looking for bearish moves! Use indexes as your gauge to long or short. Yellow lines are potential targets",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_1236.png",
         "delete":"0"
      },
      {
         "content":"$1000 and some change on the day! Signaled in",
         "section_url":null,
         "section":"attachment",
         "image_path":"attachments/options-watchlist/IMG_1277.png",
         "delete":"0"
      }
   ]
}