{
   "channel_id":1153209187376046091,
   "channel_name":"ðŸ¤â”ƒself-improvement-challenge",
   "sections":[
    {
        "content": "Here at Millionaire Access we aspire to be dominant in **EVERY** form of human endeavor, as said by Andrew Tate.\n\nThe top endeavors are:\n> Mindset and Physicality\n> Relationships with men and women\n> Money\n\nOn this challenge, we will focus on the first and the last ones.\n‎\nThe main goal of this program is to have you an **IMPROVED MAN** by the end of the next 30 days, mainly - **CLEAN FROM PORN.**\n‎\nYou guys asked for it because you know how much damage it brings to your life and how better your life will be without it.\n‎\nThis challenge isn’t mandatory. However, it is adamant you work on EVERY ASPECT OF YOURSELF!\n‎\nPorn is poison. And is currently one of the greatest addictions of our generation.\n\nIt predates on a man's primal desire to reproduce with attractive females. It's cheap, and it's everywhere.\n‎\nAnd most importantly - it's being weaponized as a tool to keep you weak and controllable.\n‎\nWomen are the biggest weakness for men.\n‎\nI don't want this to be some bullshit 'No Nut January' where you accomplish zero and just talking about your peeps.\n‎\nThis is meant to transform you from a weak kid, to a strong man.\n‎\nLet's lay the rules for the program:\n‎\n> **1-** NO PORN. NO SOFT NUDITY OR ANYTHING\n> ‎\n> **2-** NO SOCIAL MEDIA. Delete your Instagram and Facebook.\n> Note- if you use it for business, it's fine to keep. Delete all females from your following list tho.\n> ‎\n> **3-** No masturbation, edging or whatever. Only touch your thingie when you go to pee. Nothing else\n> ‎\n> **4-** YOU WILL DO SOMETHING PHYSICAL - DAILY. I don't care if it's a gym, fighting, or just pushups.\n> ‎\n> **5-** YOU WILL SET A 'MILLIONAIRE ACCESS' GOAL TO ACCOMPLISH WITH A $ AT THE END.\n> ‎\n> **6-** YOU WILL POST EVERY SINGLE DAY IN <#1125536055609786501>.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    },
    {
        "content": "**Frequently Asked Questions regarding the challenge:**\n\n**Can I keep using Social Media if I need it for business/Marketing BootCamp?**\n- Yes. Simply unfollow all females from your page.\n\n**I'm already avoiding porn and masturbation with splendid success. Can I still take the challenge?**\n- Absolutely. Pick up another bad habit you'd like to break or be there to encourage your fellow Students!\n\n**I'm a woman and would still like to take on the challenge.**\n- You're most welcome to participate! Choose a bad habit to break, and join us!\nKeep in mind it'll be centered on PMO. You will still get the benefits tho!\n\n**When is the first day? Today is X of January. Can I still join?**\n- The first day is the day you decide to take action. Calendar days mean nothing. Don't let the calendar stand in your way to glory.",
        "section_url": null,
        "section": "general",
        "image_path": null,
        "delete":"1"
    }
]}