{
   "channel_id":1148593747731427449,
   "channel_name":"ðŸ¶â”ƒdog-walking-course",
   "sections":[
      {
         "content":"🦮 **Dog Walking Course** 🦮 \n\n\"Dog Walking Side Hustle\"",
         "section_url":"https://vimeo.com/862492228/330c671034?share=copy",
         "section":"video",
         "delete":"1"
      },
      {
         "content":"**Summary:**\n- Dog walking is getting paid to take your client’s dog for a walk\n- You don’t need any up-front investment to get started\n- You need to understand the basics of dealing with dogs\n- Be prepared to go out in all weather\n\n**Action steps:**\n- Understand how you can make money from dog walking",
         "section_url":null,
         "section":"summary",
         "delete":"0"
      },
      {
         "content":"How much do you need to start dog walking?\n\nA $20-$30\nB $0 -\nC $0-$5",
         "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
      },
      {
         "content":"•\n\n\n\n\n\"How To Find Customers\"",
         "section_url":"https://vimeo.com/862492039/9dc0655d2b?share=copy",
         "section":"video",
         "delete":"1"
      },
      {
         "content":"**Summary:**\n- You don’t need any qualifications to get started but it can make you stand out\n- You can decide to walk multiple dogs at once but make sure you can handle them all\n- The easiest way to get your first clients is to ask people you already know who have dogs\n- Once you’ve exhausted everyone you know, you can go door-to-door or utilize Facebook\n\n**Action steps:**\n\u2028- Reach out to family and friends and offer to walk their dogs",
         "section_url":null,
         "section":"summary",
         "delete":"0"
      },
      {
         "content":"•\n\n\n\n\n\"Getting Paid\"",
         "section_url":"https://vimeo.com/862491803/e59d9c9622?share=copy",
         "section":"video",
         "delete":"1"
      },
      {
         "content":"**Summary:**\n- You can charge $10-$30 depending on the demand in your area\n- You can get paid in cash, bank transfer or payment processors\n- Writing a simple contract can set out the expectations on each side from the start\n\nContract example: [click here](https://docs.google.com/document/d/1Kgc8iCZBdQunjWaRvTze5TJ-SqI6hyVAghgLM8OjYdk/edit?usp=sharing)\n\n**Action steps:**\n- Apply the steps and start your dog-walking business",
         "section_url":null,
         "section":"summary",
         "delete":"0"
      },
      {
         "content":"**YOUR ACTION STEPS ** \n\n**Step 1: Ask your neighbors, family, or friends to walk their dog(s)**\n> - The fastest way to get new clients for dog walking is to simply ask people you already know.\n> - Ask your neighbors, family, or friends if you can walk their dog.\n> - Chances are you already know their dog so it will be easy to build up your experience with a dog you're familiar with.\n\n**Step 2: Walk the dogs**\n> - Once you've found someone willing to let you walk their dog, next you have to actually do it.\n> - Arrange a time to collect the dog from the owner's house - make sure you're on time.\n\n**Step 3: Profit**\n> - Once the walk is complete, ask for payment from your client.\n> - If you're getting paid cash, you can collect it upon returning the dog.\n> - If you make an agreement with your client for regular walks, you could set up a monthly or weekly retainer.\n\n**Step 4: Expand your client base**\n> - Once you've exhausted your list of people you know and you'd like to take on more work, start new outreach methods.\n> - Go through the Harness Your Facebook course and join local groups to promote your services.\n> - Design and print pamphlets to distribute in your area advertising your services.\n\n**Step 5: Repeat**\n> - Dogs need walks regularly so you can turn your existing clients into recurring clients by continuing to offer your services.\n> - If you can take on more work, repeat the steps to take on more clients.",
         "section_url":null,
         "section":"general",
         "delete":"1"
      },
      {
         "content":"What are some methods we recommend on finding more customers?\n\nA Google, Youtube and TikTok\nB Your local small business and door-knocking\nC Neighbors & Family, Facebook and Pamphlets",
         "section":"quiz",
         "quiz_id":"quiz4",
         "delete":"1"
      }
   ]
}