{
   "channel_id":1147374304061829160,
   "channel_name":"⭐┃slti-lessons",
   "sections":[
      {
         "content":"***\"What is 'Simple Long Term Investing'?\"***\n\n> Its exactly what it sounds like.\n> \n> I will give you very clear and simple instructions on what to buy, and how to buy it.\n> \n> This will be the fastest way for a beginner to form a portfolio.\n\n\n\n\n***\"What do I buy with Simple Long Term Investing Signals?\"***\n\n> You will be buying BTC and ETH.\n\n\n\n\n***\"Why should I use Simple Long Term Investing Signals when I can just buy my own crypto?\"***\n\n> Because you don't know when to buy, or when to sell.\n> \n> We do.\n\n\n\n\n***\"How long does Simple Long Term Investing Signals last for?\"***\n\n> Impossible to know in advance. Possibly Years.\n\n\n\n\n***\"What if I already have a portfolio? How can Simple Long Term Investing Signals help me?\"***\n\n> You may 'think' you have a portfolio, but it's probably just a bag of trash.\n> \n> The Simple Long Term Investing Signals is something that will make you money for sure.\n> \n> Your portfolio is probably just a handful of lottery tickets. \n\n\n\n\n***\"Ok, but if I use Simple Long Term Investing Signals, when will I know when to sell?\"***\n\n> We will tell you\n\n\n\n\n***\"The Simple Long Term Investing Signals look too basic, I need something that is 'more advanced' / 'works faster' / 'has more reward & risk'\"***\n\n> No problem, we have plenty of those strategies too. \n> \n> Do more lessons to unlock them.\n\n\n\n\n***\"How much will I make following Simple Long Term Investing Signals?\"***\n\n> Impossible to know because everyone buys at different times. Obviously.\n> \n> Do you think I have telepathy?\n> \n> You want me to just make up a random number don't you?\n> \n> If you're unironically asking this question then its an indication that you're a danger to yourself and others because you know so little about investing.\n> \n> Its ok, we am here to guide you because we are the best investors on earth.\n\n\n\n\n***Where can I find it?:***\n\n> In the ⭐｜Simple Long Term Investing channel.\n\n\n\n\n***Want to create your own portfolio strategy so you know how to invest without me having to hold your hand like a child?***\n\n> Do all the lessons and graduate the ***CRYPTO MASTERCLASS*** for a complete guide on how to make your own.\n\n\n\n\n***What type of positions are we even getting into?***\n\n> For this specific category we will be using spot positions.",
         "section_url":null,
         "section":"general",
         "delete":"1"
      }
   ]
}