{
  "channel_id": 1087615795443548200,
  "channel_name": "frequently-asked-questions",
  "sections": [
    {
      "content": "1. What is wholesaling real estate?\n\nWholesaling real estate involves finding a property that is being sold at a discount, negotiating a purchase price with the seller, and then finding a buyer to purchase the property at a higher price. The wholesaler makes a profit by earning the difference between the purchase price and the sale price.",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "2. How do I find properties to wholesale?\n\n\nThere are several ways to find properties to wholesale, including searching for properties that are being sold below market value, propstream.com, networking with other members in our discord or real estate professionals in your area, \"Driving for dollars\", Craigslist, and using other useful online real estate marketplaces.",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "3.How do I negotiate with sellers?\n\n\nNegotiating with sellers involves understanding their motivations, setting clear terms and conditions, and being willing to walk away if an agreement cannot be reached. It is important to be respectful and professional when negotiating with sellers. You can go to the \"Valuable Resources Tab\" in our discord server to study our Cold Calling Script Template, which will help you negotiate and close deals much smoother and quicker!",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "4. How do I find buyers for my wholesale deals?\n\n\nThere are several ways to find buyers for your wholesale deals, including networking with other real estate investors, you can scout buyers by locating investors who are buying in nearby areas youre wholesaling in and simply getting in contact with them to offer them a discounted property! Most of our discord members, skip this process entirely by \"JVing\" on the deal which means we supply the buyer, sell the deal and split 50/50 with you! If, you can also use different online real estate marketplaces or social media to advertise your deals to a targeted audience!",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "5. What are the risks of wholesaling real estate?\n\n\nSome of the risks of wholesaling real estate include not being able to find a buyer for the property, not being able to negotiate a good deal with the seller, and not being able to properly evaluate the condition of the property. All of these \"risks\" can be avoided if youre a discord member using our resources, tools and support!",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "6. How do I protect myself legally when wholesaling real estate?\n\n\nTo protect yourself legally when wholesaling real estate, it is important to have a written agreement with the seller that clearly outlines the terms of the sale and to conduct due diligence on the property before entering into any agreements.",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "7. How much money do I need to get started in wholesaling real estate?\n\n\nThe amount of money needed to get started in wholesaling real estate will depend on your business model and the specific deals you are working on. Most of our Discord Members  start with little or no money at all, while non-members need to have a significant amount of capital on hand to fund their deals because they're using sample contacts off the internet.",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    },
    {
      "content": "8. What are some common mistakes made by beginner wholesalers?\n\n\nSome common mistakes made by beginner wholesalers include not knowing what they're doing and expecting instant gratification, not making enough cold calls, not properly evaluating the condition of a property, not properly negotiating with sellers, and not having a clear exit strategy.",
      "section_url": null,
      "section": "general",
      "image_path": null,
      "delete": "1"
    }
  ]
}