{
   "channel_id":1131765722528354434,
   "channel_name":"🦾┃iron-body-weights",
   "sections":[
    {
        "content": "# **Weight Training┃Iron Body Program Benefits**\n\nWeight training, also known as strength training, involves using weights or resistance to build muscle and increase strength.\n\nSome of the benefits of weight training include:\n\n⦁ Increased muscle strength and size: Weight training can increase the size and strength of the muscles, improving overall physical performance and reducing the risk of injury.\n\n⦁ Improved bone density: Weight training can help improve bone density, reducing the risk of osteoporosis and fractures, especially in older adults.\n\n⦁ Improved metabolism: Weight training can increase muscle mass, which in turn can boost metabolism and promote fat loss.\n\n\n⦁ Reduced risk of chronic diseases: Weight training has been shown to reduce the risk of chronic diseases such as heart disease, diabetes, and some forms of cancer.\n\n⦁ Improved mood and mental health: Weight training has been shown to improve mood, reduce anxiety and depression, and increase self-esteem and confidence.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n# **Weight Training┃Iron Body Program (MUST KNOW)**\n\n> The rep range is 8-12, which means you should get at least 8 reps, but no more than 12.\n> \n> If you can't get 8 reps it means the weight is too heavy. If you can get more than 12 reps, the weight is too light.\n> \n> Once you've done 12 reps with a certain weight, you should increase the weight for the next set.\n> \n> For example, if you bench press 40kg for 12 reps, increase the weight to 45kg and do 8 or 9 reps.\n> \n> Time under tension (TUT) helps dictate the training stimulus. TUT is the amount of time your body, or a particular muscle or group of muscles, is under load.\n> \n> For muscle hypertrophy you need a time between 40 and up to 70 seconds of TUT.\n> \n> So if you bench press, and you normally drop the weight pretty quickly and push it back up quickly, then you might look at that as a tempo of 1010 or two seconds for each rep.\n> \n> Two seconds multiplied by 12 reps equals 24 seconds of TUT. This time limits your maximum gains in muscle mass.\n> \n> For bodybuilding purposes, time under tension (TUT) for each set should generally be in the 40-70 second range. Sets lasting less than 30 seconds tend to build speed, strength and power but don't build maximum muscle mass.\n> \n> You need at least 40 seconds of time under tension per set to stimulate maximum hypertrophy.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "•\n\n\n\n\n# **Weight Training┃Iron Body Program (TIME UNDER TENSION/TEMPO EXPLANATION)**\n\nExample of time under tension, or tempo 3-0-2-0:\n\n> ⦁ The first number is the downward phase of the movement, also known as eccentric. You move down for three seconds.\n> \n> ⦁ The second number represents the time in seconds to pause at the lower end of the movement. In this case, there is no pause.\n> \n> ⦁ The third number is the upward movement, also known as concentric. In this case, 2 seconds.\n> \n> ⦁ The fourth number represents the time in seconds to pause at the upper end of the movement. Again, there is no pause.\n> \n> Time under tension is more important than the total number or reps.\n> \n> For a tempo of 3-0-2-0, you will train like this:\n> \n> ⦁ 3 seconds eccentric movement\n> ⦁ 0 seconds pause after the eccentric movement\n> ⦁ 2 seconds concentric movement\n> ⦁ 0 seconds pause after the concentric movement",
        "section_url": null,
        "section": "general",
        "delete": "1"
    },
    {
        "content": "•\r\n\r\n\r\n\r\n\r\n> **The Fitness Campus** - Weights (Explanations) 💪🏽\r\n>",
        "section_url": "https://vimeo.com/859621345/e18ad2263f?share=copy",
        "section": "video",
        "delete": "1"
    },
    {
        "content": "||**“Just do it.”**||\n•\n\n\n\n\n> **Congratulations, you completed** <#1131765722528354434>.\n> \n> \n> On to the next channel <#1131767075002658898>.",
        "section_url": null,
        "section": "general",
        "delete": "1"
    }
]}