{
   "channel_id":1147377318227095642,
   "channel_name":"⭐┃sdca-lessons",
   "sections":[
      {
         "content":"***\"What is 'SDCA'?\"***\n\n> SDCA is an acronym for 'Strategic Dollar Cost Averaging'.\n> \n> I will give you advanced and difficult to understand instructions on what to buy, and how to buy it.\n> \n> This will be confusing for beginners, so it is recommended that you stick to ⭐｜Simple Long Term Investing until you've completed the investing masterclass lessons.\n\n\n\n\n***\"If SDCA is hard to understand, why are you telling me about it?\"***\n\n> I am going to tell you what all of your signal options are before you decide which ones are appropriate to you. \n> \n> I believe this is fair for the beginners, and for the more experienced investors.\n\n\n\n\n***\"What do I buy with SDCA?\"***\n\n> You will mainly be buying BTC and ETH. \n> \n> However I will also include other high risk / high reward positions in there, these will change over time.\n\n\n\n\n***\"Why should I use SDCA when I can just buy my own crypto?\"***\n\n> Because you don't know when to buy, or when to sell for the best results.\n> \n> We do.\n\n\n\n\n***\"How long does SDCA signals last for?\"***\n\n> Impossible to know in advance. Possibly Years.\n\n\n\n\n***\"What if I already have a portfolio? How can SDCA Signals help me?\"***\n\n> Using the principles of aggregated market valuation, you'll be able to make more accurate entry and exit decisions. \n\n\n\n\n***\"Ok, but if I use SDCA, when will I know when to sell?\"***\n\n> We will tell you\n\n\n\n\n***\"The SDCA Signals look too basic, I need something that is 'more advanced' / 'works faster' / 'has more reward & risk'\"***\n\n> No problem, we have plenty of those strategies too. \n> \n> Do more lessons to unlock them.\n\n\n\n\n***\"How much will I make following SDCA Signals?\"***\n\n> Yeah hold on one moment while I look into my crystal ball.\n> \n> Your mind is poisoned by hype marketing bullshit. \n> \n> Gains are impossible to know because everyone buys different assets at different times. Obviously.\n> \n> Do you think I have telepathy to know what you're holding, or maybe you think I can summon premonitions of what might happen in the future?\n> \n> Grow up. We are professionals here.\n> \n> Its known you'll make thousands of percent gains, but no one can know how much you make exactly.\n\n\n\n\n***Where can I find it?:***\n\n> In the ⭐｜SDCA channel\n\n\n\n\n***Want to create your own SDCA portfolio strategy so you know how to invest without me having to hold your hand like a child?***\n\n> Do all the lessons and graduate the INVESTING MASTERCLASS for a complete guide on how to make your own.",
         "section_url":null,
         "section":"general",
         "delete":"1"
      }
   ]
}